In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
animals = DataFrame(np.arange(16).reshape(4,4),columns = ['W','X','Y','Z'], 
                    index = ['Dog','Cat','Bird','Mouse'])

In [3]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [4]:
animals.ix[1:2,['W','Y']] = np.nan

In [5]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat   NaN   5 NaN   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [7]:
behavior_map = {'W':'good','X':'bad','Y':'good','Z':'bad'}

In [8]:
animal_col = animals.groupby(behavior_map, axis = 1)

In [9]:
animal_col

In [10]:
animal_col.sum()

       bad  good
Dog      4     2
Cat     12   NaN
Bird    20    18
Mouse   28    26

In [11]:
behav_series = Series(behavior_map)

behav_series

W    good
X     bad
Y    good
Z     bad
dtype: object

In [13]:
animals.groupby(behav_series,axis = 1).count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [14]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat   NaN   5 NaN   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [15]:
animals.groupby(len).sum()   # groupby the length of the index (animal name)

    W   X   Y   Z
3   0   6   2  10
4   8   9  10  11
5  12  13  14  15

In [16]:
keys = ['A','B','A','B']

In [17]:
animals.groupby([len,keys]).max()

      W   X   Y   Z
3 A   0   1   2   3
  B NaN   5 NaN   7
4 A   8   9  10  11
5 B  12  13  14  15

In [19]:
# We can also use groupby with hierarchaly index levels

#Create a hierarchal column index

hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],[1,2,3,1,2]], 
                                    names = ['City','sub_value'])

In [21]:
dframe_hr = DataFrame(np.arange(25).reshape(5,5), columns = hier_col)

In [24]:
dframe_hr = dframe_hr *100

In [25]:
dframe_hr

City          NY                   SF
sub_value      1      2      3      1      2
0              0    500   1000   1500   2000
1           2500   3000   3500   4000   4500
2           5000   5500   6000   6500   7000
3           7500   8000   8500   9000   9500
4          10000  10500  11000  11500  12000